let topSellersSection =[
       {name:'شلوار پارچه ای مردانه ',id:3,desc:`لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.`,productSize:['32','33','34','35','36','37','38','39','40'],price:730000,imgSrc:["pics/men/3/713McdX8erL._AC_UX569_.jpg","pics/men/3/71plx8JULmL._AC_UX569_.jpg"],mainImgSrc:"pics/men/3/71plx8JULmL._AC_UX569_.jpg",off:0,category:'men'},
       {name:'پیراهن لاکچری مردانه ',id:4,desc:`لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.`,productSize:['32','33','34','35','36','37','38','39','40'],price:1000000,imgSrc:["pics/men/4/81jWwiB6qSL._AC_UX569_.jpg","pics/men/4/916EUFOjaXL._AC_UX569_.jpg"],mainImgSrc:"pics/men/4/81jWwiB6qSL._AC_UX569_.jpg",off:40,category:'men'},
       {name:'شلوار لی مردانه ',id:5,desc:`لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.`,productSize:['32','33','34','35','36','37','38','39','40'],price:800000,imgSrc:["pics/men/5/717Lrbe3o1L._AC_UX679_.jpg","pics/men/5/71ee8rszmgL._AC_UX679_.jpg"],mainImgSrc:"pics/men/5/71ee8rszmgL._AC_UX679_.jpg",off:10,category:'men'},
       {name:'پیراهن مردانه مردانه ',id:6,desc:`لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.`,productSize:['32','33','34','35','36','37','38','39','40'],price:750000,imgSrc:["pics/men/6/81jIidOC65L._AC_UY550_.jpg","pics/men/6/81NefCoaJ9L._AC_UY550_.jpg"],mainImgSrc:"pics/men/6/81NefCoaJ9L._AC_UY550_.jpg",off:0,category:'men'},{name:'تیشرت زنانه  ',id:7,desc:`لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.`,productSize:['32','33','34','35','36','37','38','39','40'],price:780000,imgSrc:["pics/women/1/712W6XEqZHL._AC_SX569._SX._UX._SY._UY_.jpg","pics/women/1/71qEs5yATEL._AC_SX569._SX._UX._SY._UY_.jpg"],mainImgSrc:"pics/women/1/712W6XEqZHL._AC_SX569._SX._UX._SY._UY_.jpg",off:0,category:'women'},
       {name:'تیشرت زنانه  ',id:8,desc:`لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.`,productSize:['32','33','34','35','36','37','38','39','40'],price:770000,imgSrc:["pics/women/2/71-M9xriW7L._AC_UX569_.jpg","pics/women/2/71vbKFj71HL._AC_UX569_.jpg"],mainImgSrc:"pics/women/2/71vbKFj71HL._AC_UX569_.jpg",off:0,category:'women'},
]



const topSellersSectionReducer = (state=topSellersSection,action)=>{
       switch(action.type){
              //
default:
       return state

       }
}

export default topSellersSectionReducer